#float version gets accuracy of 99.31%

name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "BinaryConvolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    group:5
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  debug_param{
    xnorno_grad:true
  }
}
layer{
  name:"norm1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "norm1"
}
layer {
  bottom: "norm1"
  top: "conv1_sc"
  name: "bn1_scal"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer{
  name: "relu1"
  type: "ReLU"
  bottom: "conv1_sc"
  top: "relu1"

} 
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "relu1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "BinaryConvolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    group:5
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  debug_param{
    xnorno_grad:true
  }
}
layer{
  name:"norm2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "norm2"
}
layer {
  bottom: "norm2"
  top: "conv2_sc"
  name: "bn2_scal"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer{
  name: "relu2"
  type: "ReLU"
  bottom: "conv2_sc"
  top: "relu2"

} 
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "relu2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "BinaryInnerProduct"
  bottom: "pool2"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  debug_param{
    xnorno_grad:true
  }
}
layer{
  name:"ip1_norm"
  type: "BatchNorm"
  bottom: "ip1"
  top: "ip1_norm"
}
layer {
  bottom: "ip1_norm"
  top: "ip1_sc"
  name: "ip1_sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "ip1_relu"
  type: "ReLU"
  bottom: "ip1_sc"
  top: "ip1_relu"
}
layer {
  name: "ip2"
  type: "BinaryInnerProduct"
  bottom: "ip1_relu"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
  debug_param{
    xnorno_grad:true
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
